{
  "app-title": "Home | Mizuno Rintaro • Portfolio",
  "loading": "Loading...",
  "greetings": "Hi there, I'm ",
  "name": "Mizuno Rintaro",
  "name-end": ".",
  "sub-heading": "Welcome to my corner of the web.",
  "more-info": "I have over 9 years of experience in system design, DB design, and test design, and have a deep understanding and track record in these fields. I have over 9 year of experience in backend development using Go, and I am highly skilled. I also have over 9 years of development experience in programming languages ​​such as Python, Go, PHP, and Ruby, and can handle a wide range of technologies. I also have extensive experience in designing APIs and GraphQL. I can handle engineer communication in both English and Japanese, and I have no problem communicating with people in remote meetings or on Slack.",
  "resume-btn": "resume",
  "about-heading": "about me",
  "about-text-top": "I graduated from a university in Vietnam in May 2016, and in June 2016, through a referral from a senior, I began working at SENS Co., Ltd. in Vietnam as a contract employee for two years. Afterward, I moved to Dirox Co., Ltd., where I worked as a full-stack engineer for about two years on the development of a legal management system. In November 2020, I joined SunBytes Co., Ltd., where I contributed to the development of a hotel management system. In June 2022, I joined SCS Solution Co., Ltd. as a backend engineer, where I participated in the development of AI bots. Most recently, in July 2023, I joined Luum Co., Ltd. as a backend engineer, where I contributed to the development of a matching system. After leaving Luum, I worked primarily with Japanese clients through platforms such as Lancers and CrowdWorks.",
  "about-text-bottom": "",
  "technology-heading": "technology",
  "projects-heading": "projects",
  "featured-tag": "featured project",
  "projects": [
    {
      "id": 1,
      "description": "My two years at SENS Co., Ltd. were a period of significant personal and professional growth. In particular, working on the development of the hospital management system allowed me to be involved in a wide range of activities, from requirements definition and basic design to detailed design, development, testing, and implementation. Through this experience, I gained a comprehensive understanding of the entire system development process and deepened my knowledge of the technologies and skills required at each stage. The opportunity to work with new technologies on a daily basis and feel my growth with each challenge was one of the most rewarding aspects of my time there."
    },
    {
      "id": 2,
      "description": "My nearly two years at Dirox Co., Ltd. were an incredibly rewarding experience. As a full-stack engineer, I was primarily involved in the development of a legal management system, focusing on backend development. I gained hands-on experience in designing and implementing the entire system. In particular, working with Go and MongoDB for backend development allowed me to tackle system design based on actual business needs, while also working on optimization and performance improvements. This experience helped me build a deep understanding and technical expertise in backend development."
    },
    {
      "id": 3,
      "description": "I joined Sunbytes Co., Ltd. in November 2020 and began working on the development of a hotel management system. As a full-stack engineer, I was responsible for a wide range of tasks, from the basic system design to implementation. In particular, working with Laravel and Vue.js required me to have a comprehensive understanding of both frontend and backend development, which helped me refine my ability to oversee and progress development from an overall perspective. This experience allowed me to gain a deep understanding of the entire development process and acquire the knowledge and skills needed to ensure smooth system development."
    },
    {
      "id": 4,
      "description": "In June 2022, I joined SCS Solutions Co., Ltd. as a backend engineer and began working on AI development. The use of AI technology was a completely new area for me, but it was an exciting opportunity to engage with cutting-edge technologies, and I made new discoveries every day. In particular, working with OpenAI and Gemini allowed me to gain a deeper understanding of the potential of AI. Through this experience, I learned about AI algorithms and data processing techniques, and I was able to enhance my implementation skills when integrating these technologies into systems."
    },
    {
      "id": 5,
      "description": "From the start of the project, I clearly defined the target users of the service and focused on designing the service with that personal in mind."
    },
    {
      "id": 6,
      "description": "I set priorities by clarifying the background of each feature addition, such as the AI ​​chatbot to make up for labor shortages. I also focused on UI/UX design, pursuing simple and intuitive operability. Furthermore, we focused on multilingual support with an eye toward global expansion, and on strengthening security."
    },
    {
      "id": 7,
      "description": "In this project, the relationship of trust with the user company was beginning to deteriorate from the beginning. Therefore, I acted as a coordinator between the client`s various departments, thoroughly communicating with them and focusing on vendor control, while paying close attention to building relationships. Through this project, I was reminded of the importance of smooth communication with clients and the ability to execute projects."
    },
    {
      "id": 8,
      "description": "I am building and operating the website [Pet no Jitsuya] that supports the sale of puppies and kittens by reputable breeders. It implements functions such as breeder registration, disclosure of pedigree and health information of puppies and kittens, and matching with potential buyers. In addition, I also provide an intermediary service for genetic testing of dogs and cats, and have developed a system for linking with testing institutions and an online application function for testing."
    },
    {
      "id": 9,
      "description": "It was a system that required high performance in the sense that it aggregated data from each tenant company and processed it in real time. Initially, performance was poor, and while investigating the cause, it was discovered that there was a problem with the database. A redesign contributed to improving performance."
    },
    {
      "id": 10,
      "description": "I was involved in the entire process from planning to design and development of Healthengine, a smartphone app that supports health promotion. Its main functions include recording daily activity and food intake, setting goals and checking progress, and health advice using AI. By visualizing data and incorporating gamification elements, I have devised a way to help people develop healthy habits while having fun."
    }
  ],
  "show-more-btn": "show more",
  "show-less-btn": "show less",
  "learn-more": "more info",
  "navigation": [
    {
      "menuTitle": "home",
      "href": "/#home"
    },
    {
      "menuTitle": "about",
      "href": "/#about"
    },
    {
      "menuTitle": "technology",
      "href": "/#technology"
    },
    {
      "menuTitle": "projects",
      "href": "/#projects"
    }
  ],
  "footer-contact": "e-mail",
  "footer-message": "address: 愛知県名古屋市緑区小坂2-1014-9"
}
