{
  "app-title": "ホーム | 田中将斗 • ポートフォリオ",
  "loading": "読み込み中...",
  "greetings": "こんにちは! ",
  "name": "田中将斗",
  "name-end": " です。",
  "sub-heading": "私のウエブのコーナーへようこそ。",
  "more-info": "システム設計、DB設計、テスト設計の経験が3年以上あり、これらの分野での深い理解と実績があります。Goを使ったバックエンド開発の経験が1年以上あり、高いスキルを持っています。また、Java、C#、PHP、Rubyなどのプログラミング言語での開発経験が3年以上あり、幅広い技術に対応できます。APIやGraphQLの設計経験も豊富です。英語と日本語でのエンジニアコミュニケーションにも対応でき、リモート会議やSlackでのやり取りも問題ありません。",
  "resume-btn": "レジュメ",
  "about-heading": "私について",
  "about-text-top": "私の名前は田中将斗で、ソフトウェアのために何かを作るのが好きです。中国福建省出身。2016年中国の莆田大学情報工学部卒業後、日本のリブ・マックス会社に入社。大手不動産会社向け賃貸管理システム改修やホテルチェーン向け宿泊予約システム新規開発などに従事。要件定義から設計、開発、テストと上流工程から関与し、システム全体を通した視点と経験を積みました。2018年に妻の実家のある沖縄に転居し、現職に中途入社。結婚を機に沖縄の伝統文化にも触れ、家族重視の日本的価値観を体得。フェーズ横断的な経験とマネジメント能力。その後、新型コロナウイルス感染症の世界的流行の影響で前職を退職せざるを得ず、病気の治療後フリーランスとして活動しております。",
  "about-text-bottom": "",
  "technology-heading": "テクノロジー",
  "projects-heading": "プロジェクト",
  "featured-tag": "目玉プロジェクト",

  "projects": [
    {
      "id": 1,
      "description": "不動産販売の効率化と顧客対応の改善を目的に、物件情報や顧客情報を一元管理し、ウェブサイト上で最新情報を提供するシステムの機能拡張プロジェクトに携わりました。私は詳細設計の段階から参画し、要件定義、設計、テストなどを主導する重要な役割を担いました。"
    },
    {
      "id": 2,
      "description": "ホテル現場の実情を把握するため、複数のホテルを訪問し、従業員へのヒアリングを行いました。UI/UXの観点から実際の業務フローを理解し、使いやすさを追求したシステム設計を心掛けました。また、スマホアプリの予約機能の拡充に注力し、顧客ニーズに合わせた機能拡張を重視しました。リリース後は定期的にフィードバックを収集し、アップデートを続けることで、顧客満足度の維持・向上に努めています。"
    },
    {
      "id": 3,
      "description": "離れた拠点のチームメンバーとスムーズに連携できるよう、リモート開発の最適化を図りました。さらに、パフォーマンスとセキュリティを常に意識し、大量トラフィックや不正アクセスにも耐えうるシステムを構築しました。リリース後は運用監視とメンテナンスにも携わりしました。"
    },
    {
      "id": 4,
      "description": "複数の建設会社を訪問し、従業員へのヒアリングを実施。中古機械の検索方法や希望仕様など、ユーザーニーズを把握し設計に反映させました。また、既存の手作業による販売フローを可視化し、業務効率化のポイントを洗い出しシステム要件に組み込みました。"
    },
    {
      "id": 5,
      "description": "プロジェクト立ち上げ時から、サービスのターゲットユーザーを明確に定義し、そのペルソナを常に意識したサービス設計に主力いたしました。"
    },
    {
      "id": 6,
      "description": "AIチャットボットは人手不足を補うためなど、それぞれの機能追加の背景を明確にすることで優先度を決めました。また、UI/UXデザインには力を入れ、シンプルで直感的な操作性を追求しました。さらに、グローバル展開を見据えたマルチリンガル対応や、セキュリティ強化にも注力しました。"
    },
    {
      "id": 7,
      "description": "このプロジェクトでは、参画当初からユーザー企業との信頼関係が損なわれつつある状況でした。そのため、お客様内の各部門の調整役としてコミュニケーションを徹底し、ベンダーコントロールにも注力しながら、関係構築に細心の注意を払いました。このプロジェクトを通じて、お客様との円滑なコミュニケーションと、プロジェクト遂行力の重要性を改めて実感しました。"
    },
    {
      "id": 8,
      "description": "優良なブリーダーの方々の子犬・子猫の販売をサポートするウェブサイト「ペットの実家」の構築・運営を行っています。ブリーダー登録機能、子犬・子猫の血統・健康情報公開機能、購入希望者とのマッチング機能などを実装しています。あわせて、犬猫の遺伝子検査の仲介サービスも提供しており、検査機関との連携システムやオンライン検査申込機能なども開発しました。"
    },
    {
      "id": 9,
      "description": "各テナント企業からのデータを集約し、リアルタイムに処理するという意味で非常にパフォーマンスが要求されるシステムであった。当初はパフォーマンスが出ずに、その原因を追究していく内にDBに問題がある事が判明。再設計を行いパフォーマンス改善に寄与した。"
    },
    {
      "id": 10,
      "description": "健康増進をサポートするスマートフォン向けアプリ「Healthengine」の企画から設計、開発までを一貫して手掛けました。主な機能としては、日々の活動量や食事の記録機能、目標設定と達成度の確認機能、AIを活用した健康アドバイス機能などがあります。データの可視化やゲーミフィケーション要素の導入により、楽しみながら健康習慣が身につくように工夫しています。"
    }
  ],
  "show-more-btn": "もっと見る",
  "show-less-btn": "非表示",
  "learn-more": "詳しく見る",
  "navigation": [
    {
      "menuTitle": "ホーム",
      "href": "/#home"
    },
    {
      "menuTitle": "私について",
      "href": "/#about"
    },
    {
      "menuTitle": "テクノロジー",
      "href": "/#technology"
    },
    {
      "menuTitle": "プロジェクト",
      "href": "/#projects"
    }
  ],
  "footer-contact": "メール",
  "footer-message": "住所: 愛知県名古屋市緑区小坂2-1014-9"
}
