{
  "app-title": "ホーム | 水野 • ポートフォリオ",
  "loading": "読み込み中...",
  "greetings": "こんにちは! ",
  "name": "水野",
  "name-end": " です。",
  "sub-heading": "私のウエブのコーナーへようこそ。",
  "more-info": "システム設計、DB設計、テスト設計の経験が9年以上あり、これらの分野での深い理解と実績があります。Goを使ったバックエンド開発の経験が9年以上あり、高いスキルを持っています。また、Java、C#、PHP、Rubyなどのプログラミング言語での開発経験が9年以上あり、幅広い技術に対応できます。APIやGraphQLの設計経験も豊富です。英語と日本語でのエンジニアコミュニケーションにも対応でき、リモート会議やSlackでのやり取りも問題ありません。",
  "resume-btn": "レジュメ",
  "about-heading": "私について",
  "about-text-top": "私の名前は水野倫太郎で、ソフトウェアのために何かを作るのが好きです。2016年5月にベトナムの大学を卒業し、2016年6月から先輩の紹介でベトナムのSENS株式会社で契約社員として2年間勤務いたしました。 その後にはDirox株式会社に転職して約2年間ぐらいフルスタックエンジニアとして法律管理システムの開発に参加させていただきました。 2020年11月からはSunBytes株式会社に入社してホテル管理システムの開発に参加させていただきました。 その後には2022年6月からはSCS Solution株式会社でバックエンドエンジニアとしてAIのBOT開発に参加させていただきました。 最後に2023年7月からはLuum株式会社でバックエンドエンジニアとしてマッチングシステムの開発に参加させていただきました。 Luum株式会社で退職した後にはLancersとCrowdWorksを通じて日本のクライアントと主に仕事をしておりました。",
  "about-text-bottom": "",
  "technology-heading": "テクノロジー",
  "projects-heading": "プロジェクト",
  "featured-tag": "目玉プロジェクト",

  "projects": [
    {
      "id": 1,
      "description": "SENS株式会社での2年間は、私にとって非常に成長の多い期間でした。特に、病院管理システムの開発においては、要件定義から基本設計、詳細設計、開発、テスト、導入まで幅広く携わることができました。この経験を通じて、システム開発の全体像を理解し、各工程で求められる技術や知識を深めることができました。日々の仕事で多くの新しい技術に触れ、その度に成長を実感できたことが大きな魅力でした。"
    },
    {
      "id": 2,
      "description": "Dirox株式会社での約2年間は、私にとって非常に充実した経験でした。フルスタックエンジニアとして、主に法律管理システムの開発に携わり、バックエンドの開発を中心に、システム全体の設計から実装までを経験することができました。特に、Go言語とMongoDBを使用したバックエンド開発では、実際のビジネスニーズに基づいたシステム設計に取り組み、最適化やパフォーマンス改善を行うことができました。この経験により、バックエンド開発の深い知識と技術力を身につけることができたと感じています。"
    },
    {
      "id": 3,
      "description": "2020年11月からSunbytes株式会社に入社し、ホテル管理システムの開発に従事することになりました。ここでは、フルスタックエンジニアとして、システムの基本設計から導入まで幅広い工程を担当しました。特に、LaravelとVue.jsを使用した開発では、フロントエンドとバックエンドの両方を見渡す視点を持つことが求められ、システム全体を俯瞰して開発を進めるスキルが磨かれました。この経験により、開発プロセス全体を深く理解し、スムーズなシステム開発を実現するための知識と技術を身につけることができました。"
    },
    {
      "id": 4,
      "description": "2022年6月からSCS Solutions株式会社でバックエンドエンジニアとしてAI開発に携わることになりました。AI技術を活用した開発は私にとって非常に新しい領域でしたが、最先端の技術に関わることができ、日々新しい発見がありました。特に、OpenAIやGeminiを利用した開発に取り組んだことで、AIが持つ可能性を深く理解することができました。この経験を通じて、AIのアルゴリズムやデータ処理に関する技術を学び、システムに組み込む際の実装力を高めることができました。"
    },
    {
      "id": 5,
      "description": "プロジェクト立ち上げ時から、サービスのターゲットユーザーを明確に定義し、そのペルソナを常に意識したサービス設計に主力いたしました。"
    },
    {
      "id": 6,
      "description": "AIチャットボットは人手不足を補うためなど、それぞれの機能追加の背景を明確にすることで優先度を決めました。また、UI/UXデザインには力を入れ、シンプルで直感的な操作性を追求しました。さらに、グローバル展開を見据えたマルチリンガル対応や、セキュリティ強化にも注力しました。"
    },
    {
      "id": 7,
      "description": "このプロジェクトでは、参画当初からユーザー企業との信頼関係が損なわれつつある状況でした。そのため、お客様内の各部門の調整役としてコミュニケーションを徹底し、ベンダーコントロールにも注力しながら、関係構築に細心の注意を払いました。このプロジェクトを通じて、お客様との円滑なコミュニケーションと、プロジェクト遂行力の重要性を改めて実感しました。"
    },
    {
      "id": 8,
      "description": "優良なブリーダーの方々の子犬・子猫の販売をサポートするウェブサイト「ペットの実家」の構築・運営を行っています。ブリーダー登録機能、子犬・子猫の血統・健康情報公開機能、購入希望者とのマッチング機能などを実装しています。あわせて、犬猫の遺伝子検査の仲介サービスも提供しており、検査機関との連携システムやオンライン検査申込機能なども開発しました。"
    },
    {
      "id": 9,
      "description": "各テナント企業からのデータを集約し、リアルタイムに処理するという意味で非常にパフォーマンスが要求されるシステムであった。当初はパフォーマンスが出ずに、その原因を追究していく内にDBに問題がある事が判明。再設計を行いパフォーマンス改善に寄与した。"
    },
    {
      "id": 10,
      "description": "健康増進をサポートするスマートフォン向けアプリ「Healthengine」の企画から設計、開発までを一貫して手掛けました。主な機能としては、日々の活動量や食事の記録機能、目標設定と達成度の確認機能、AIを活用した健康アドバイス機能などがあります。データの可視化やゲーミフィケーション要素の導入により、楽しみながら健康習慣が身につくように工夫しています。"
    }
  ],
  "show-more-btn": "もっと見る",
  "show-less-btn": "非表示",
  "learn-more": "詳しく見る",
  "navigation": [
    {
      "menuTitle": "ホーム",
      "href": "/#home"
    },
    {
      "menuTitle": "私について",
      "href": "/#about"
    },
    {
      "menuTitle": "テクノロジー",
      "href": "/#technology"
    },
    {
      "menuTitle": "プロジェクト",
      "href": "/#projects"
    }
  ],
  "footer-contact": "メール",
  "footer-message": "住所: 愛知県名古屋市緑区小坂2-1014-9"
}
